---
type: Metal
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 14
tags: [revit-api, class]
---

# Metal

`Autodesk.Revit.DB.Visual.Metal` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | MetalColor | 2018.1 | `public static string MetalColor { get ; }` |
| Property | MetalFinish | 2018.1 | `public static string MetalFinish { get ; }` |
| Property | MetalPatina | 2018.1 | `public static string MetalPatina { get ; }` |
| Property | MetalPattern | 2018.1 | `public static string MetalPattern { get ; }` |
| Property | MetalPatternHeight | 2018.1 | `public static string MetalPatternHeight { get ; }` |
| Property | MetalPatternScale | 2018.1 | `public static string MetalPatternScale { get ; }` |
| Property | MetalPatternShader | 2018.1 | `public static string MetalPatternShader { get ; }` |
| Property | MetalPerforations | 2018.1 | `public static string MetalPerforations { get ; }` |
| Property | MetalPerforationsCenter | 2018.1 | `public static string MetalPerforationsCenter { get ; }` |
| Property | MetalPerforationsShader | 2018.1 | `public static string MetalPerforationsShader { get ; }` |
| Property | MetalPerforationsSize | 2018.1 | `public static string MetalPerforationsSize { get ; }` |
| Property | MetalType | 2018.1 | `public static string MetalType { get ; }` |